Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ལས་ལངས་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: Having arisen therefrom, they become absorbed in the sphere of infinite consciousness; and, having arisen therefrom, they become absorbed in the absorption of cessation.

source: དེ་ལས་ལངས་ནས་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: Having arisen therefrom, they become absorbed in the sphere of nothing-at-all; and, having arisen therefrom, they become absorbed in the absorption of cessation.

source: དེ་ལས་ལངས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: Having arisen therefrom, they become absorbed in the sphere of neither perception nor nonperception; and, having arisen therefrom, they become absorbed in the absorption of cessation.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཐབས་མཁས་པ་དང་ལྡན་པ་རྣམས་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་འདི་དག་ཡང་དང་ཡང་དུ་རྣམ་པར་མནན་ཅིང་སྙོམས་པར་འཇུག་པ་དག་ཀྱང་ཡོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་།
en: So it is, Śāradvatīputra, that bodhisattva great beings who practice the perfection of wisdom with skillful means repeatedly interrupt and become absorbed in these meditative concentrations, immeasurable attitudes, meditative stabilities, and absorptions. “

source: སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཐོབ་པ། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཐོབ་པ།
en: Śāradvatīputra, there are also bodhisattva great beings who have attained the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཐོབ་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: They have attained the gateways of the meditative stabilities and the dhāraṇīs, and they have attained the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཐོབ་པ་དག་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་ཐོབ་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་མི་བྱེད་ཀྱི།
en: Though they have attained the three gateways to liberation, they do not attain the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སེམས་ཅན་རྣམས་ལ་སྟོན་པར་བྱེད་དེ།
en: However, they do practice the perfection of wisdom, and they do teach the noble eightfold path to beings, favoring them with their skillful means.

source: སེམས་ཅན་དེ་དག་དེས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བར་བྱེད་པ་དག་ཀྱང་ཡོད་དེ།
en: Thereby, beings will attain the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: ཤ་ར་དྭ་བུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་འབྲས་བུ་ཐོབ་པར་བྱ་བའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ་ཡིན་ཏེ།
en: Śāradvatīputra, the wisdom through which the fruits of the śrāvakas and pratyekabuddhas are attained is the receptiveness of bodhisattva great beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟ་བུས་དེ་ལྟར་རྣམ་པར་སྤྱོད་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཡིན་པར་ཤེས་པར་བྱའོ།
en: Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner are known to be irreversible in their progress. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། དགའ་ལྡན་གྱི་གནས་ཡོངས་སུ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དེ།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections, and who refine the paradise of Tuṣita.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་བསྐལ་པ་བཟང་པོ་པར་ཤེས་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། བསམ་གཏན་བཞི་ཐོབ་པ། ཚད་མེད་པ་བཞི་དང་།
en: Śāradvatīputra, those bodhisattva great beings are known to belong to the Auspicious Eon. “

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ། མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who practice the perfection of wisdom, who have attained the four meditative concentrations, who have attained the four immeasurable attitudes, the four formless absorptions, and the thirty-seven factors conducive to enlightenment, who have attained the six extrasensory powers, and who have attained the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཐོབ་པ་དག་འཕགས་པའི་བདེན་པ་བཞི་ཁོང་དུ་ཆུད་པར་བྱ་བའི་དོན་དུ་སྤྱོད་ཀྱང་། བདེན་པ་བཞི་རྟོགས་པར་མི་བྱེད་པ་དག་ཀྱང་ཡོད་དེ།
en: Even though they practice in order that the four truths of the noble ones might be comprehended, they do not engage in the realization of the four truths.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་ཚེ་གཅིག་གིས་ཐོགས་པར་ཤེས་པར་བྱའོ།
en: Śāradvatīputra, those bodhisattva great beings are known to be destined for only one more rebirth. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དག་འཇིག་རྟེན་གྱི་ཁམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་འདོང་ཞིང་།
en: Śāradvatīputra, there are also bodhisattva great beings who practice the six perfections and who roam from world system to world system.

source: དེ་དག་གི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་དག་ཀྱང་ཡོད་དེ།
en: They encourage the beings of those worlds toward enlightenment, and they refine the buddhafields.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: Śāradvatīputra, those bodhisattva great beings will attain manifest buddhahood in unsurpassed, complete enlightenment over countless, limitless eons. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་རྟག་པར་བརྩོན་ཏེ།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections and who always persevere for the sake of beings.

source: ནམ་ཡང་གནོད་པར་འགྱུར་བའི་ཚིག་མི་སྨྲ།
en: They never speak harmful words.

source: གནོད་པ་དང་ལྡན་པའི་ལུས་ཀྱི་ལས་དང་། ཡིད་ཀྱི་ལས་མི་བྱེད་པ་དག་ཀྱང་ཡོད་དོ།
en: Nor indeed do they commit physical acts or mental acts that are harmful. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་སེམས་ཅན་གྱི་དོན་དུ་རྟག་ཏུ་བརྩོན་པས།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections and who always persevere for the sake of beings.

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདོང་ཞིང་། སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་ལམ་གསུམ་པོ་རྒྱུན་གཅོད་པ་དག་ཀྱང་ཡོད་དོ།
en: They move from buddhafield to buddhafield, interrupting the three pathways through which beings proceed to lower realms. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཉེ་བར་བསྒྲུབ་ཅིང་། ཟས་འདོད་པ་རྣམས་ལ་ཟས་དང་སྐོམ་འདོད་པ་རྣམས་ལ་སྐོམ་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections and who are actively engaged in the perfection of generosity.

source: བཞོན་པ་འདོད་པ་རྣམས་ལ་བཞོན་པ་དང་། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་མལ་སྟན་དང་གོས་དང་རྒྱན་དང་འཚོ་བ་དང་ཁྱིམ་འདོད་པ་རྣམས་ལ་ཁྱིམ་གྱིས་ཡོངས་སུ་སྡུད་ཅིང་འཚོ་བའི་ཡོ་བྱད་སྐྱོན་མེད་པ་ཡོངས་སུ་སྒྲུབ་པ་དག་ཀྱང་ཡོད་དོ།
en: They will arrange all resources that bring comfort to beings, gathering food for those who need food, drink for those who need drink, and vehicles for those who need vehicles, and they will provide those who need flowers, perfumes, garlands, unguents, bedding, mats, clothing, ornaments, sustenance, and homes with homes [and so forth], and with faultless sustaining resources.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྡོམ་པ་ལ་རབ་ཏུ་འགོད་པ་དག་ཀྱང་ཡོད་དོ།
en: There are those who are actively engaged in the perfection of ethical discipline, who will establish beings in the vows pertaining to body, speech, and mind.

source: །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་ཁྲོ་བ་མེད་པ་དང་། གནོད་སེམས་མེད་པ་ལ་རབ་ཏུ་འགོད་པ་དག་ཀྱང་ཡོད་དོ།
en: There are those who are actively engaged in the perfection of tolerance, who will establish beings in avoiding anger and malice.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་བརྩོན་པ་ལ་རབ་ཏུ་འགོད་པ་དག་ཀྱང་ཡོད་དོ།
en: There are those who are actively engaged in the perfection of perseverance, who will engage and establish beings in all virtuous attributes.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་ཞི་གནས་རྩེ་གཅིག་ཏུ་བྱ་བ་དང་། འདོད་པ་ལས་དབེན་པ་ལ་རབ་ཏུ་འགོད་པ་དག་ཀྱང་ཡོད་དོ།
en: There are those who are actively engaged in the perfection of meditative concentration, who will secure beings one-pointedly in stillness, and establish them in freedom from desires.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། སེམས་ཅན་རྣམས་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་འགོད་པ་དག་ཀྱང་ཡོད་དོ།
en: There are those who are actively engaged in the perfection of wisdom, who will establish beings in nonfixation with respect to all phenomena. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྷུར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་ལུས་སུ་མངོན་པར་སྤྲུལ་ཏེ།
en: Dt.68} “Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections, who are actively engaged in the perfection of wisdom, and who emanate a body like that of the tathāgatas.

source: སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ལ་ངན་སོང་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བའི་ཕྱིར་ཆོས་སྟོན་པ་དག་ཀྱང་ཡོད་དོ།
en: They teach the Dharma in order that denizens of the hells, beings born within the animal realm, and beings of the world of Yama might transcend all the lower realms. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། སངས་རྒྱས་ཀྱི་སྐུ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་ལུས་སུ་མངོན་པར་སྤྲུལ་ནས། ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་དོང་ཞིང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། ཆོས་ཉན་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections, who emanate a body like that of the tathāgatas, and who, proceeding to the buddhafields of the eastern direction, numerous as the grains of sand of the river Gaṅgā, teach the Dharma to beings, serve the tathāgatas, listen to their Dharma, and behold the distinctive attributes of the community of bodhisattvas and the qualities of those buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་ཕྱེ་བ་དག་ཀྱང་མཐོང་བར་བྱེད་ཅིང་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་མཚན་མ་ཡོངས་སུ་བཟུང་སྟེ། དེ་བས་ཀྱང་རྒྱ་ཆེ་བ་ཁྱད་པར་དུ་འཕགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མང་པོ་ཡོངས་སུ་སྒྲུབ་ཅིང་།
en: They will take on the characteristics of those buddhafields, and they will perfect many buddhafields that are even more extensive.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཤ་སྟག་སྐྱེ་བར་བྱེད་པ་དག་ཀྱང་ཡོད་དོ།
en: Bodhisattva great beings in those buddhafields will exclusively be destined for only one more rebirth.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། སངས་རྒྱས་ཀྱི་ཞིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་དོང་ཞིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། ཆོས་ཉན་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་།
en: Similarly, there are those who, proceeding to the buddhafields in each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, teach the Dharma to beings, serve the tathāgatas, listen to their Dharma, and behold the distinctive attributes of the community of bodhisattvas and the qualities of those buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་བྱེ་བ་དག་ཀྱང་མཐོང་བར་བྱེད་ཅིང་། དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་མཚན་མ་ཡོངས་སུ་བཟུང་སྟེ། དེ་བས་ཀྱང་རྒྱ་ཆེ་བ་ཁྱད་པར་དུ་འཕགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མང་པོ་ཡོངས་སུ་སྒྲུབ་ཅིང་།
en: They will take on the characteristics of those buddhafields, and they will perfect many buddhafields that are even more extensive. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་བྱས་ཏེ། དབང་པོ་གསལ་ཞིང་ཡོངས་སུ་དག་པ་དང་ལྡན་པར་གྱུར་ནས།
en: Śāradvatīputra, there are also bodhisattva great beings who, when they practice the six perfections, will acquire the thirty-two major marks, with clear and utterly pure sense faculties.

source: དེ་དག་ལུས་ཡོངས་སུ་དག་པ་དེ་དག་གིས་སྐྱེ་བོ་མང་པོ་དགའ་བ་དང་མོས་པ་སྐྱེད་དེ།
en: Through their purified bodies, they will cause many beings to rejoice and aspire.

source: དེ་དག་འགྲོ་བ་མང་པོའི་སྙིང་དུ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་དང་། སེམས་ཅན་དེ་དག་ཀྱང་སེམས་མོས་པར་གྱུར་པའི་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་མཐར་གྱིས་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་པ་དག་ཀྱང་ཡོད་དོ།
en: Through these very roots of virtue, which are pleasing and agreeable to the hearts of many beings, and to which they aspire, they will enable even those beings to attain final nirvāṇa in a gradual manner, by means of the three vehicles.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལུས་ཡོངས་སུ་དག་པ་དང་ངག་ཡོངས་སུ་དག་པ་དང་ཡིད་ཡོངས་སུ་དག་པ་ལ་བསླབ་པར་བྱའོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they should train in the purity of body, the purity of speech, and the purity of mind. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དག་དབང་པོ་ཤིན་ཏུ་གསལ་བ་ཐོབ་ནས།
en: Śāradvatīputra, there are also bodhisattva great beings who practice the six perfections and who have obtained extremely clear sense faculties.

source: དེ་དག་དབང་པོ་ཤིན་ཏུ་གསལ་བ་དེ་དག་གིས་བདག་མི་བསྟོད་ཅིང་གཞན་མི་སྨོད་པ་དག་ཀྱང་ཡོད་དོ།
en: Owing to these extremely clear sense faculties, {Dt.70} they neither praise themselves nor do they disparage others. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་ཕྱིན་ཆད། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Śāradvatīputra, there are also bodhisattva great beings who, from the time when they first begin to set their mind on enlightenment, maintain the perfection of generosity and the perfection of ethical discipline.

source: ཕྱིར་མི་ལྡོག་པའི་ས་མ་ཐོབ་ཀྱི་བར་དུ་ནམ་ཡང་དབུལ་བར་མི་འགྱུར་ཞིང་། ལོག་པར་འགྲོ་བ་དང་ངན་སོང་དུ་མི་ལྟུང་བ་དག་ཀྱང་ཡོད་དོ།
en: Until they attain the level at which progress has become irreversible, they will never be destitute and they will never regress into mistaken views or lower realms. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་ཕྱིན་ཆད། ཕྱིར་མི་ལྡོག་པའི་ས་མ་ཐོབ་ཀྱི་བར་དུ། ནམ་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མི་གཏོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, there are also bodhisattva great beings who, from the time when they first begin to set their mind on enlightenment until they attain the level at which progress has become irreversible, will never forsake the paths of the ten virtuous actions. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ནས་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ལ་སེམས་ཅན་རབ་ཏུ་འགོད་པ་དང་། སྦྱིན་པ་དང་ངག་སྙན་པས་སེམས་ཅན་ཡོངས་སུ་སྡུད་པ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the perfection of generosity and the perfection of ethical discipline, and who, on becoming imperial monarchs, will establish beings in the paths of the ten virtuous actions, and attract beings through their generosity and pleasant voice. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཡོངས་སུ་བཟུང་སྟེ།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the perfection of generosity and the perfection of ethical discipline, and who, on assuming the kingdom of an imperial monarch, then maintain many hundreds of thousands of such kingdoms.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་བརྒྱ་སྟོང་དུ་མ་ལ་གནས་ཤིང་དེ་དག་ལ་གནས་ནས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་མཉེས་པར་བྱེད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཡོ་བྱད་ཐམས་ཅད་དང་། མཆོད་པ་སྣ་ཚོགས་ཀྱིས། རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་པ་དག་ཀྱང་ཡོད་དོ།
en: Maintaining these kingdoms, they please many hundred billion trillions of buddhas, and they serve, venerate, honor, and worship those lord buddhas with all sorts of resources and various offerings. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། སེམས་ཅན་ལོག་པར་ལྟ་བའི་མུན་པ་ཅན་རྣམས་ལ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་སྣང་བར་བྱེད་ཅིང་བདག་ཉིད་ཀྱང་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ། སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བ་དེ་དང་ནམ་ཡང་འབྲལ་བར་མི་བྱེད་པ་དག་ཀྱང་ཡོད་དེ།
en: Dt.71} “Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections, who illuminate through the buddhas’ teachings those beings who have deluded and mistaken views; until they attain manifest buddhahood in unsurpassed, complete enlightenment they themselves will never be without that illumination of the buddhas’ teachings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཡང་དག་པར་བྱུང་བ་ཡིན་ནོ།
en: Śāradvatīputra, these are the bodhisattva great beings who bring forth the buddhas’ teachings. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་རྣམས་ཀྱི་གོ་མི་དབྱེའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Dt.72} “So it is, Śāradvatīputra, that when bodhisattva great beings practice the perfection of wisdom, they should have no occasion to indulge in physical, verbal, or mental actions that are objectionable.” {

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་།
en: Dt.73} Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, what are the objectionable physical actions that bodhisattva great beings might have?

source: ངག་གི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་གང་ལགས།
en: What are the corresponding verbal actions, and what are the corresponding mental actions?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཤིང་། འདི་ནི་ལུས་ཡིན་གྱིས་དེས་ནི་ལུས་ཀྱི་ལས་ཤིག་བརྩམ།
en: Śāradvatīputra,” replied the Blessed One, “when bodhisattva great beings think, ‘This is the body on the basis of which a physical action is to be undertaken.

source: འདི་ནི་ངག་ཡིན་གྱིས་དེས་ནི་ངག་གི་ལས་ཤིག་བརྩམ།
en: This is the speech on the basis of which a verbal action is to be undertaken.

source: འདི་ནི་ཡིད་ཡིན་གྱིས་དེས་ནི་ཡིད་ཀྱི་ལས་ཤིག་བརྩམ་སྙམ་ན། དེ་ནི་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་རྩོམ་པ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའོ།
en: This is the mind on the basis of which a mental action is to be undertaken,’ Śāradvatīputra, that denotes the objectionable physical, verbal, and mental actions that bodhisattva great beings might have.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ནི་ལུས་གང་དང་ངག་གང་དང་ཡིད་གང་གིས་འཇུངས་པའི་སེམས་བསྐྱེད་པ་འམ། ཚུལ་ཁྲིམས་ངན་པའི་སེམས་བསྐྱེད་པ་འམ། གནོད་སེམས་ཀྱི་སེམས་བསྐྱེད་པའམ། ལེ་ལོའི་སེམས་བསྐྱེད་པ་འམ། འཁྲུག་པའི་སེམས་བསྐྱེད་པ་འམ།
en: However, Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom do not apprehend body, they do not apprehend speech, and they do not apprehend mind, in such a way that with some body, some speech, or some mind they would give rise to thoughts of miserliness, thoughts of degenerate morality, thoughts of malice, thoughts of indolence, thoughts of distraction, or thoughts of stupidity.

source: ཤེས་རབ་འཆལ་པའི་སེམས་བསྐྱེད་པར་བྱ་བ་དེ་ལྟ་བུའི་ལུས་མི་དམིགས་སོ། །ངག་མི་དམིགས་སོ། །སེམས་མི་དམིགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་སྐྱེད་པ་ཙམ་དུ་ཡང་ཤེས་པར་མི་བྱ་སྟེ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, there is no way for them even to give rise to the factors of body, speech, and mind that take on negative states.

source: དེ་ནི་གནས་མེད་དོ།
en: It would be impossible.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་སྦྱོང་སྟེ།
en: If you ask why, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they are purifying the factors of body, speech, and mind that take on negative states.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །གསོལ་པ།
en: So these, Śāradvatīputra, are bodhisattva great beings’ physical, verbal, and mental actions that are free from being objectionable.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བ་དང་།
en: Śāradvatīputra then asked, “Blessed Lord, how do bodhisattva great beings purify the factors of the body that take on negative states?

source: ངག་གི་གནས་ངན་ལེན་སྦྱོང་བ་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བ་ལགས།
en: How do they purify the factors of speech and mind that take on negative states?” “
